docs/modules/defaults/freemacs-defaults.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en_US" xml:lang="en_US">
<head>
<!-- 2022-07-07 Thu 18:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Defaults Configuration</title>
<meta name="author" content="Thomas Freeman" />
<meta name="keywords" content="Emacs" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../../init.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Defaults Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf21b0ad">Automatic Time Stamps</a></li>
<li><a href="#org6582437">Bidirectional Editing</a></li>
<li><a href="#org0a3d3f4">Display Battery Mode</a></li>
<li><a href="#orgb9b0ff6">Send Deleted Files to System Trash</a></li>
<li><a href="#org95efabf">Backup Files with Version Control</a></li>
<li><a href="#orgc2a2aa7">Indent Using Spaces</a></li>
<li><a href="#org09836a6">Inhibit Startup Screen</a></li>
<li><a href="#org5d3f690">Register Delay</a></li>
<li><a href="#orgbe966df">Ring Bell Function</a></li>
<li><a href="#org42f18cb">Shorten "Yes or No" to "Y or N"</a></li>
<li><a href="#org69cf569">Show Column Number</a></li>
<li><a href="#orge211783">End</a></li>
</ul>
</div>
</div>
<p>
The code below collects customizations for Emacs built-in components.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">emacs</span>
  <span style="color: #1ea8fc;">:custom</span>
  <span style="color: #ff2afc;">(</span>bidi-paragraph-direction 'left-to-right<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>delete-by-moving-to-trash t<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>version-control t<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>delete-old-versions t<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>vc-make-backup-files t<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>inhibit-startup-screen t<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>register-preview-delay 0<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>ring-bell-function #'ignore<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>visible-bell t<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>column-number-mode t<span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:config</span>
  <span style="color: #ff2afc;">(</span>add-hook 'before-save-hook 'time-stamp<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">if</span> <span style="color: #a7da1e;">(</span>version&lt;= <span style="color: #7984D1;">"27.1"</span> emacs-version<span style="color: #a7da1e;">)</span>
      <span style="color: #a7da1e;">(</span><span style="color: #ff2afc; font-weight: bold;">setq</span> bidi-inhibit-bpa t<span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">setq-default</span> indent-tabs-mode nil<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>fset 'yes-or-no-p 'y-or-n-p<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>

<div id="outline-container-orgf21b0ad" class="outline-2">
<h2 id="orgf21b0ad">Automatic Time Stamps</h2>
<div class="outline-text-2" id="text-orgf21b0ad">
<p>
Emacs supports time stamps in any text buffer where <code>Time-stamp: &lt;&gt;</code> can be found in the first eight lines. The <code>time-stamp</code> command can then be used to automatically update the time. A simpler solution, however, is to have Emacs automatically update the time stamp when the buffer is saved.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>add-hook 'before-save-hook 'time-stamp<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6582437" class="outline-2">
<h2 id="org6582437">Bidirectional Editing</h2>
<div class="outline-text-2" id="text-org6582437">
<p>
Emacs supports bidirectional editing. This is rarely used feature for many and can actually result in slower performance. To improve performance if bidirectional editing it not used, the following can be set:
</p>

<ol class="org-ol">
<li><p>
Tell Emacs that text should be read from left to right.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>bidi-paragraph-direction 'left-to-right<span style="color: #1ea8fc;">)</span>
</pre>
</div></li>

<li><p>
Turn off bidrectional editing mode.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">if</span> <span style="color: #ff2afc;">(</span>version&lt;= <span style="color: #7984D1;">"27.1"</span> emacs-version<span style="color: #ff2afc;">)</span>
    <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">setq</span> bidi-inhibit-bpa t<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div></li>
</ol>
</div>
</div>

<div id="outline-container-org0a3d3f4" class="outline-2">
<h2 id="org0a3d3f4">Display Battery Mode</h2>
<div class="outline-text-2" id="text-org0a3d3f4">
<p>
Display Battery Mode will display the battery charge status in the modeline 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">battery</span>
  <span style="color: #1ea8fc;">:config</span>
  <span style="color: #ff2afc;">(</span>display-battery-mode t<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb9b0ff6" class="outline-2">
<h2 id="orgb9b0ff6">Send Deleted Files to System Trash</h2>
<div class="outline-text-2" id="text-orgb9b0ff6">
<p>
Emacs does not send files to the trash by default which is counter-intuitive for many beginning users. <i>In order to risk losing files it is a good idea to turn on the option to send all files to the system trash.</i>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>delete-by-moving-to-trash t<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org95efabf" class="outline-2">
<h2 id="org95efabf">Backup Files with Version Control</h2>
<div class="outline-text-2" id="text-org95efabf">
<p>
Emacs has a built-in version control system in which it will create a series of backup files. This will create a number of backup flies, however, that will need to be cleaned up on a regular basis.
</p>


<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>version-control t<span style="color: #1ea8fc;">)</span>
<span style="color: #1ea8fc;">(</span>delete-old-versions t<span style="color: #1ea8fc;">)</span>
<span style="color: #1ea8fc;">(</span>vc-make-backup-files t<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc2a2aa7" class="outline-2">
<h2 id="orgc2a2aa7">Indent Using Spaces</h2>
<div class="outline-text-2" id="text-orgc2a2aa7">
<p>
Indenting with spaces rather than tabs is genrally recommended when working with code. Especially when writing code in Python.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">setq-default</span> indent-tabs-mode nil<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org09836a6" class="outline-2">
<h2 id="org09836a6">Inhibit Startup Screen</h2>
<div class="outline-text-2" id="text-org09836a6">
<p>
After seeing the startup screen hundreds of times, there is no longer any need to load it on startup as it no longer contains any new information.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>inhibit-startup-screen t<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5d3f690" class="outline-2">
<h2 id="org5d3f690">Register Delay</h2>
<div class="outline-text-2" id="text-org5d3f690">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>register-preview-delay 0<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbe966df" class="outline-2">
<h2 id="orgbe966df">Ring Bell Function</h2>
<div class="outline-text-2" id="text-orgbe966df">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>ring-bell-function #'ignore<span style="color: #1ea8fc;">)</span>
<span style="color: #1ea8fc;">(</span>visible-bell t<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org42f18cb" class="outline-2">
<h2 id="org42f18cb">Shorten "Yes or No" to "Y or N"</h2>
<div class="outline-text-2" id="text-org42f18cb">
<p>
To make work faster, instead of typing "yes" or "no" for each question prompt, use just "y" or "n"
.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>fset 'yes-or-no-p 'y-or-n-p<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org69cf569" class="outline-2">
<h2 id="org69cf569">Show Column Number</h2>
<div class="outline-text-2" id="text-org69cf569">
<p>
Many programming language style guides recommend that each line of code is less than 80 characters long. To determine if code lines are too long, a simple tool is to activate <code>column-number-mode</code>. Once enabled, the current column (i.e. the number of characters on that line) will be displayed.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>column-number-mode t<span style="color: #1ea8fc;">)</span>
</pre>
</div>

<p>
A better fix would be to use code formatters to prevent lines from getting too long. For example, Apheleia will run formatters such as Black on Python code to keep code lines from becoming too long.
</p>
</div>
</div>

<div id="outline-container-orge211783" class="outline-2">
<h2 id="orge211783">End</h2>
<div class="outline-text-2" id="text-orge211783">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">provide</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-defaults</span><span style="color: #1ea8fc;">)</span>

<span style="color: #546A90;">;;; </span><span style="color: #546A90;">freemacs-defaults.el ends here</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Time-stamp: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-07-07 Thu 17:21&gt;</span></span></p>
<p class="author">Author: Thomas Freeman</p>
<p class="date">Created: 2022-07-07 Thu 18:43</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
